{
    "btn-started": "Get started",
    "btn-components": "Components",
    "sub-title":"A small library for react with variety of ui components.",
    "change-lang":"Change language",
    "title-instalation":"Installation",
    "txt-instalation":"To install the library you will need to run the following command.",
    "copy":"copy",
    "requisites":"Prerequisites",
    "txt-requisites":"For this library you need to have a react project generated by vite. You can check the documentation on the vite page.",
    "txt-vite-tutorial":"Documentation on vite.",
    "txt-import":"Once the library is installed, you can import the module as follows:",
    "components-txt":"With the library installed we will have access to these components:",
    "dev-route":"In the development route, it is planned to implement more components that are being developed, such as any of the following:",
    "nav":"Navigation bar",
    "form":"Forms",
    "btn":"Buttons",
    "txt-modal":"To use this component we must import this package",
    "txt-modal-btn":"In this case we will have to create a function to open the modal:",
    "simple-props-modal":"These are the minimum props that the component needs to function.",
    "modal-extra-props":"If you add a confirmation function and pass the confirm={true} prop to the modal, it will become a confirmation window.",
    "dir-modal":"The direction accessory supports 4 types, down, up, left, right, which will make the modal appear on that side.",
    "full-code":"Complete code :",
    "txt-tooltip":"In this case we will have to wrap the specific element with the tooltip component.",
    "tooltip-props":"This component accepts two props, text for the text to display, and direction for the position of the tooltip(top/bottom).",
    "txt-drag":"These are the minimum props that the component needs.",
    "props-drag":"We can specify the document type for , .pdf, word, excel , .odt or .txt .With the image type it allows the loading of jpeg, png, gif, webp and svg+xml",
    "props-drag-multi":"With the multiple prop we can upload several files at the same time.",
    "import-drag":"To use this component we must import this package and declare a setFile function."
}