{
    "btn-started": "Comenzar",
    "btn-components": "Componentes",
    "sub-title":"Una pequeña biblioteca para react con varios componentes de interfaz de usuario.",
    "change-lang":"Cambiar idioma",
    "title-instalation":"Instalación",
    "txt-instalation":"Para instalar la biblioteca, deberá ejecutar el siguiente comando.",
    "copy":"copiar",
    "requisites":"Requisitos previos",
    "txt-requisites":"Para esta librería necesita tener un proyecto react generado por vite. Puede consultar la documentación en la página de vite .",
    "txt-vite-tutorial":"Documentación en vite.",
    "txt-import":"Una vez instalada la biblioteca podrá importar el módulo de la siguiente manera:",
    "components-txt":"Con la biblioteca instalada tendremos acceso a estos componentes:",
    "dev-route":"En la ruta de desarrollo esta pensado implementar mas componentes que se estas desarrollando como alguno de los siguientes:",
    "nav":"Barra de navegación",
    "form":"Formularios",
    "btn":"Botones",
    "txt-modal":"Para usar este componente debemos importar este paquete:",
    "txt-modal-btn":"En este caso deberemos crear un función para abrir el modal :",
    "simple-props-modal":"Estas son las props mínimos que el componente necesita para funcionar.",
    "modal-extra-props":"Si agrega una función de confirmación y pasa la propiedad confirm={true} al modal, se convertirá en una ventana de confirmación.",
    "dir-modal":"La prop de dirección admite 4 tipos, bottom, top, left, right, lo que hará que el modal aparezca en ese lado.",
    "full-code":"Codigo completo :",
    "txt-tooltip":"En este caso deberemos envolver el elemento en concreto con el componente tooltip.",
    "tooltip-props":"Este componente acepta dos props, text para el texto del tooltip y direction para la posición(top/bottom) .",
    "txt-drag":"Estas son las props mínimas que necesita el componente.",
    "props-drag":"Podemos especificar el tipo document para , .pdf, word, excel , .odt o .txt .Con el tipo image permite la carga de jpeg, png, gif, webp y svg+xml.",
    "props-drag-multi":"Con la prop multiple podemos subir varios archivos a la vez.",
    "import-drag":"Para utilizar este componente debemos importar este paquete y declarar una función setFile."

}